<a href="https://colab.research.google.com/github/harikagirigari/nlplab/blob/main/NLP_exp_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import re

In [ ]:
data_out = pd.read_csv('/content/twitter4000.csv')

In [ ]:
#For removing emails
pattern = r'\w+@\w+.\w+'

In [ ]:
pattern = r'\b[A-za-z._+-]+@[A-za-z.].[A-z|a-z]{2,}\b'

In [ ]:
data_out['twitts'].apply(lambda x: re.findall(pattern=pattern, string=x))

0       []
1       []
2       []
3       []
4       []
        ..
3995    []
3996    []
3997    []
3998    []
3999    []
Name: twitts, Length: 4000, dtype: object

In [ ]:
#For removing URLs
pattern = r'http\S+|www\S+'
data_out['twitts'].apply(lambda x: re.findall(pattern=pattern, string=x))

0           []
1           []
2       [wwww]
3           []
4           []
         ...
3995        []
3996        []
3997        []
3998        []
3999        []
Name: twitts, Length: 4000, dtype: object

In [ ]:
#For removing Numbers
pattern = r'\w+[0-9]\w+'
data_out['twitts'].apply(lambda x: re.findall(pattern=pattern, string=x))

0           []
1           []
2           []
3           []
4           []
         ...
3995        []
3996        []
3997        []
3998        []
3999    [18th]
Name: twitts, Length: 4000, dtype: object